content-org/all-posts.org
#+hugo_base_dir: ../
#+macro: abbr @@html:<abbr title="$2">$1</abbr>@@
#+macro: dfn @@html:<dfn>$1</dfn>@@
#+macro: var @@html:<var>$1</var>@@
#+macro: q @@html:<q cite="$1">$2</q>@@
#+macro: person @@html:<span class="person p-name">$1</span>@@
#+macro: lang @@html:<span class="language">$1</span>@@

*** DONE HTML, The Programming Language                     :opinion:language:HTML:
CLOSED: [2023-06-24 11:50]
:PROPERTIES:
:EXPORT_FILE_NAME: html_the_programming_language
:END:
**** Intro
Ah yes, the eternal dispute over whether  {{{abbr(HTML,Hyper-Text Markup Language)}}} counts as a proper programming language seems to bring out the best and worst of our community's collective rational faculties. A veritable feast of half-baked attempts to define away the problem by appealing to whatever convenient characteristics the speaker happens upon, combined with a sprinkling of more serious thinkers seeking some grand philosophical theory to explain it all. But don't get your hopes up - you won't find any silver bullet solutions here folks. Just a parade of armchair theoreticians grasping blindly for some sense of clarity amidst the fog of poorly thought out positions. So gather 'round, listen up, and prepare yourself for another round of pointless squabbling. The fun is just beginning!

**** The Loops And The Features
Individuals frequently endeavor to delineate programming languages by differentiating them from {{{lang(HTML)}}}, contending that a programming language possesses specified traits. Traits that might encompass looping structures, conditional statements, or even compilations. Alas, these efforts are founded upon retrospective comprehension - reliant on past personal observations of what constitutes a programming language. This flawed methodology, inherently, undermines the legitimacy of their claims inasmuch as they concurrently explore discrepancies between what is deemed not to be a programming language. A circular argument ensues, lacking genuineness, and thus futile in supporting the allegation that {{{lang(HTML)}}} lacks programming language attributes.

Alright, listen up! Let's say I'm dead set on accusing Tom of being a thieving scoundrel while vehemently asserting that Amanda is as innocent as can be. To make my case, I start off by drawing a sharp contrast between Tom and Amanda. Then, after much contemplation, I concoct a ridiculously specific definition of a thief: "Anyone who happens to be a man in his sixties with an academic background in History." Can you believe that? Now, picture this - imagine we go ahead and convict every poor soul who fits this outrageous description. Well, I'll tell you right now, that's a load of nonsense! It simply won't fly, and anyone with half a brain can see how utterly flawed and impractical that notion is.

**** The Turing Completeness
Now, let me tell you about those folks who prefer a more unified approach when it comes to defining something, like a programming language. They often rely on axioms, you know, those fundamental principles that serve as the bedrock of reasoning. One of the most famous examples is the notion of /Turing completeness/ being the ultimate defining factor. At first glance, it may not seem problematic. But here's the burning question: Why on earth would we go down that route?

Think about it. We create distinctions in definitions to aid us in effectively communicating a concept amongst ourselves. As far as I know, most programmers couldn't care less about whether a programming language can perform every single computation imaginable in theory. No, sir! Instead, they value the practical aspects like ease of use and reliability when it comes to solving a specific set of problems. So, how in the world would that earlier theoretical claim serve us in our day-to-day tasks? It's a real head-scratcher, especially when you consider that such a filter would let languages like brainfuck and whitespace pass through, while disregarding /total/ programming languages that could actually lead to more robust and dependable software.

But here's the kicker - some people actually advocate for this madness. They've come up with a seemingly cohesive definition of a programming language, but their motivations for choosing that definition are nothing more than an afterthought. As a result, their definitions are utterly useless, or at the very least, useless to those who couldn't care less about denigrating a language. Can you believe it? What a ridiculous state of affairs!

**** Dear Reader
Now, let me be clear, my intention here is not to rally behind {{{abbr(HTML,Hyper-Text Markup Language)}}} and extol its virtues. Instead, I aim to shed light on our incessant desire to bestow added significance upon the definition of our work. And, quite frankly, I implore you to put an end to it. You see, a programming language can possess capabilities or be lacking in them, and a programmer may be focused on orchestrating the flow of information or on its presentation. We come in all shapes and forms, each with our unique approaches. Attempting to establish some sort of gatekeeping mechanism in this endeavor will only result in programmers overlooking the fact that they may just require {{{abbr(HTML,Hyper-Text Markup Language)}}} and {{{abbr(CSS,Casscading Style Sheet)}}} to fulfill their job requirements. This, in turn, contributes to the sorry state of the web-bloated and disheartening.

Let us cherish our roles as creators and refrain from placing undue emphasis on the definition of our jobs, but rather, let us focus on the outcomes we produce. After all, we are all creators and problem-solvers at heart.

